# TextLabelType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings..::..TextLabelType Property
AnalysisDisplayMarkersAndTextSettings Class See Also
---
Type of diagram text label visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get; set; }
```

Visual Basic
---
```text
Public Property TextLabelType As AnalysisDisplayStyleMarkerTextLabelType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleMarkerTextLabelType TextLabelType {
	AnalysisDisplayStyleMarkerTextLabelType get ();
	void set (AnalysisDisplayStyleMarkerTextLabelType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace